{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping three UI change features (headshot image update, crown emoji in nav, footer font size increase) to their target files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary catalog describing the purpose and key details of each frontend source file in the project.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, card, sidebar, and chart variables.",
  "frontend/index.html": "HTML entry point for the ProSellers React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that composes the full landing page by rendering all section components in order with SectionConnector dividers between them.",
  "frontend/src/components/AboutSection.tsx": "'Meet The Founder' section displaying Mayur Sahu's updated headshot image with gold corner accents, credential list with CheckCircle icons, and scroll-triggered slide-in animations.",
  "frontend/src/components/CaseStudiesSection.tsx": "Case studies section rendering three animated glassmorphism cards with before/after metric count-up animations and Recharts bar charts for three client success stories.",
  "frontend/src/components/ComparisonSection.tsx": "Renders a two-column comparison section contrasting US Agency drawbacks against ProSellers benefits, using IntersectionObserver for scroll-triggered reveal animations.",
  "frontend/src/components/FAQSection.tsx": "Displays an accordion-style FAQ section with expand/collapse functionality for common Amazon consulting questions, using IntersectionObserver for scroll animations.",
  "frontend/src/components/FlagStripSection.tsx": "Renders an infinitely scrolling horizontal strip of country flags (via flagcdn.com) with flutter animations and edge fade masks, representing 14 supported Amazon marketplaces.",
  "frontend/src/components/FloatingSideStrip.tsx": "A fixed bottom floating contact bar that appears after scrolling 700px, providing quick links to phone, email, and a Calendly booking page.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying the ProSellers brand, global service regions, copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/GlobalServiceSection.tsx": "Displays a grid of four country cards (US, UK, Canada, Australia) with flag images and market descriptions, featuring hover effects and scroll-triggered reveal animations.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with an animated particle canvas, parallax scroll effect, count-up stat badges, and smooth-scroll CTA buttons for an Amazon consulting landing page.",
  "frontend/src/components/HowWeWorkSection.tsx": "Four-step process section displaying a numbered grid of cards (Audit, Gap Analysis, Plan, Optimization) with intersection-observer reveal animations and a desktop connector line.",
  "frontend/src/components/LeadMagnetSection.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with scroll-aware styling, smooth-scroll links to page sections, and a responsive mobile hamburger menu with a 'Book Call' CTA button.",
  "frontend/src/components/PositioningSection.tsx": "Static section targeting ideal clients (private label sellers doing $5k–$100k/month) using a headline and a 2-column checkmark bullet grid.",
  "frontend/src/components/PricingSection.tsx": "Three-tier pricing section (Starter $499, Growth $999, Elite $1999) with feature lists, an elevated 'Most Popular' card, and intersection-observer reveal animations.",
  "frontend/src/components/ProblemSection.tsx": "Pain-points section displaying six common Amazon seller problems (high ACOS, suspension, poor ranking, etc.) as icon cards in a responsive grid with staggered reveal animations.",
  "frontend/src/components/ScrollButtons.tsx": "Renders fixed scroll-to-top and scroll-to-bottom buttons that appear after the user scrolls past 600px, styled with gold accents and hover effects.",
  "frontend/src/components/SectionConnector.tsx": "Displays an animated gold pulsing dot connector element used as a visual divider between page sections.",
  "frontend/src/components/ServicesSection.tsx": "Renders a four-card services grid (Amazon Growth, Brand Development, Emergency Services, eBay Management) with scroll-triggered reveal animations.",
  "frontend/src/components/StrategyCallSection.tsx": "Displays a three-column section with a strategy call booking form, a contact form, and a PDF download form, all with scroll-triggered animations and gold styling.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a grid of five client testimonial cards with star ratings and scroll-triggered staggered reveal animations.",
  "frontend/src/components/TrustSecuritySection.tsx": "Displays four trust and security feature cards (confidentiality, NDA, payments, direct communication) with scroll-triggered animations and gold left-border styling.",
  "frontend/src/components/WhyChooseSection.tsx": "Renders a 'Why Choose Us' section with five animated cards highlighting key differentiators (direct access, cost savings, limited slots, performance focus, long-term partnership), using Intersection Observer for scroll-triggered reveal animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates/refetches dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module with no backend queries, used for a static landing page that requires no data fetching.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS variables for the dark navy/gold theme, and declaring utility classes for glassmorphism cards, scroll-reveal animations, and shimmer button effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom brand colors (gold, navy, silver), typography/heading font families, custom shadows, border radii, and animation keyframes for the landing page design system.",
  "project_state.json": "Project state tracking file documenting the current build version, feature list, architectural decisions, known issues, and pending changes for the ProSellers Amazon consultant landing page."
}