{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Hero, Problem Section, Services, Pricing, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key implementation details for the landing page.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark theme color tokens used by shadcn-ui components.",
  "frontend/index.html": "HTML entry point for the React app titled 'Mayur Sahu Amazon Growth Consultant' that mounts the app at the root div.",
  "frontend/src/App.tsx": "Root React component that composes all nine landing page sections in order with animated SectionConnector dividers between them, plus a sticky Navigation and Footer.",
  "frontend/src/components/AboutSection.tsx": "Founder profile section featuring a headshot with gold corner accents, hover scale effect, credential list with CheckCircle icons, and scroll-triggered slide-in animations for both columns.",
  "frontend/src/components/CaseStudiesSection.tsx": "Case studies section displaying three client result cards with animated count-up metric counters and Recharts bar charts comparing before/after KPIs, revealed via IntersectionObserver.",
  "frontend/src/components/Footer.tsx": "Minimal dark footer showing the consultant's name, dynamic copyright year, and a caffeine.ai attribution link with UTM tracking and a gold heart icon.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with an animated particle canvas, parallax scroll effect, intersection-observer-triggered badge reveal, and a count-up animation for years of experience.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with scroll-aware styling, smooth-scroll links to page sections, a 'Book Call' CTA button, and a responsive hamburger menu for mobile.",
  "frontend/src/components/PositioningSection.tsx": "Static section that targets ideal clients by displaying four qualifying bullet points (revenue range, seller type, markets, intent) in a two-column card grid.",
  "frontend/src/components/PricingSection.tsx": "Pricing section displaying three tiered plans (Starter, Growth, Elite) as cards with features and CTAs, using IntersectionObserver for staggered reveal animations.",
  "frontend/src/components/ProblemSection.tsx": "Section listing six common Amazon seller pain points as icon cards (high ACOS, suspension, ranking, etc.) with staggered IntersectionObserver reveal animations.",
  "frontend/src/components/ServicesSection.tsx": "Services section presenting four offerings (Account Management, Brand Development, Emergency Services, eBay Management) as numbered icon cards with staggered scroll-reveal animations.",
  "frontend/src/components/StrategyCallSection.tsx": "A landing page section with a form and Calendly placeholder for booking a free 30-minute Amazon growth strategy call, featuring scroll-triggered reveal animations and a gold/dark theme.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays a grid of five client testimonial cards with star ratings, scroll-triggered animations, and staggered transition delays on a dark background.",
  "frontend/src/components/WhyChooseSection.tsx": "Renders a five-column grid of reason cards (direct access, cost savings, limited slots, performance, partnership) with icons and scroll-triggered reveal animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module with no exports, indicating no backend queries are needed for this static landing page.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS variables, utility classes (glass-card, gold theme, reveal animations), and base styles for the dark-themed site.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom brand colors (gold, navy, silver), typography fonts (Cormorant Garamond, Inter), box shadows, border radii, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the current state of the premium Amazon Growth Consultant landing page project, including version, architectural notes, known issues, and a detailed list of implemented features across 12+ sections with visual and interactive upgrades."
}