{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report describing two implemented features: restructuring StrategyCallSection.tsx into a three-box layout and removing the standalone LeadMagnetSection from App.tsx.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing each component's purpose, styling, and key functionality for the ProSellers landing page.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, card, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the ProSellers React app, mounting the app into a root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component that composes all landing page sections in order with SectionConnectors between them; LeadMagnetSection has been removed and the flow ends with StrategyCallSection before the Footer.",
  "frontend/src/components/AboutSection.tsx": "Founder profile section featuring a headshot with gold corner accents, credential list with CheckCircle icons, and scroll-triggered slide-in animations for left and right columns.",
  "frontend/src/components/CaseStudiesSection.tsx": "Case studies section displaying three client cards with before/after metric counters, animated count-up values, and Recharts bar charts showing ACOS, revenue, and conversion improvements.",
  "frontend/src/components/ComparisonSection.tsx": "Renders a side-by-side comparison section contrasting US agencies with ProSellers across cost, access, and strategy points, using IntersectionObserver for scroll-reveal animations.",
  "frontend/src/components/FAQSection.tsx": "Displays an accordion-style FAQ section with expand/collapse functionality for questions about ProSellers' Amazon consulting approach, pricing, and communication model.",
  "frontend/src/components/FlagStripSection.tsx": "Shows an infinitely scrolling horizontal strip of country flags with flutter animations, representing the 14 Amazon marketplaces ProSellers serves.",
  "frontend/src/components/FloatingSideStrip.tsx": "A fixed bottom floating bar that appears after scrolling 700px, providing quick-access links for phone, email, and a Calendly booking button.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying ProSellers branding, global service regions, copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/GlobalServiceSection.tsx": "Displays a grid of four country cards (US, UK, Canada, Australia) with flag images and market descriptions, using IntersectionObserver for staggered scroll-reveal animations.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with an animated particle canvas, parallax scroll effect, count-up stat badges, and smooth-scroll CTA buttons for an Amazon consulting landing page.",
  "frontend/src/components/HowWeWorkSection.tsx": "Four-step process section displaying an audit-to-optimization growth framework in a responsive grid with intersection-observer reveal animations and a desktop connector line.",
  "frontend/src/components/LeadMagnetSection.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with scroll-aware styling, smooth-scroll links to page sections, a 'Book Call' CTA, and a collapsible mobile hamburger menu.",
  "frontend/src/components/PositioningSection.tsx": "Targeting section that lists ideal client criteria (revenue range, seller type, market) as checkmark bullet cards to qualify serious Amazon sellers.",
  "frontend/src/components/PricingSection.tsx": "Three-tier pricing section (Starter, Growth, Elite) with feature lists, a highlighted 'Most Popular' card, and intersection-observer reveal animations.",
  "frontend/src/components/ProblemSection.tsx": "Pain-points section displaying six common Amazon seller problems (high ACOS, suspensions, poor ranking, etc.) as icon cards with staggered reveal animations.",
  "frontend/src/components/ScrollButtons.tsx": "Renders fixed scroll-to-top and scroll-to-bottom buttons that appear after the user scrolls past 600px, styled with gold accents and hover effects.",
  "frontend/src/components/SectionConnector.tsx": "Displays an animated gold pulsing dot with expanding rings used as a visual divider between page sections.",
  "frontend/src/components/ServicesSection.tsx": "Renders a four-card services grid (Amazon Growth, Brand Development, Emergency Services, eBay Management) with scroll-triggered reveal animations.",
  "frontend/src/components/StrategyCallSection.tsx": "Displays a three-column section with a strategy call booking form, a WhatsApp contact option, and a PDF download form, with scroll-triggered animations.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a grid of five client testimonial cards with star ratings and scroll-triggered staggered reveal animations.",
  "frontend/src/components/TrustSecuritySection.tsx": "Displays four trust and security feature cards (confidentiality, NDA, payments, direct communication) with scroll-triggered reveal animations and hover effects.",
  "frontend/src/components/WhyChooseSection.tsx": "Renders a 'Why Choose Us' section with five animated glass-card tiles highlighting key differentiators (direct access, cost savings, limited slots, performance, partnership), using IntersectionObserver for scroll-triggered reveal animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all non-actor queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module with no exports, indicating no backend queries are needed for this static landing page.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind layers, defining CSS custom properties for the dark navy/gold theme, and utility classes for glassmorphism cards, scroll-reveal animations, and shimmer button effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom gold and navy brand colors, Cormorant Garamond/Inter font families, gold box-shadow utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file recording version 29 of the ProSellers Amazon consultant landing page, documenting architectural decisions, existing features, known issues, and the latest change merging LeadMagnetSection into StrategyCallSection."
}