{
  "kind": "build_request",
  "title": "Replace About headshot, add crown to ProSellers logo, increase footer font sizes",
  "projectName": "ProSellers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-51",
      "text": "In AboutSection.tsx, replace the existing headshot image source with the newly generated asset 'mayur-sahu-headshot-new.dim_400x500.png' from frontend/public/assets/generated/. All other layout, gold corner accents, scroll-triggered slide-in animations, and credential content must remain unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "yes",
          "Replace About section headshot with newly uploaded Mayur Sahu photo (navy blue blazer, white shirt, framed artwork background)"
        ]
      },
      "acceptanceCriteria": [
        "The About / Meet The Founder section displays the new photo of Mayur Sahu (navy blue blazer, white shirt, framed artwork background) instead of the old headshot.",
        "The image renders correctly in both desktop two-column layout and mobile stacked layout.",
        "Gold corner accents and scroll-triggered slide-in animations are unaffected."
      ]
    },
    {
      "id": "REQ-52",
      "text": "In Navigation.tsx, add a gold crown emoji 👑 immediately before the 'ProSellers' brand name text in the logo/brand area of the navigation bar. The crown must be styled in gold (#C9A84C) and rendered inline with the brand text. All existing navigation links, sticky behavior, mobile hamburger menu, and Book Call CTA must remain unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "crown on the brand name prosellers",
          "Add gold crown emoji 👑 before 'ProSellers' brand name in the Navigation bar logo"
        ]
      },
      "acceptanceCriteria": [
        "The Navigation bar logo area displays '👑 ProSellers' with the crown emoji rendered in gold color before the brand name.",
        "The crown appears on both desktop and mobile navigation views.",
        "All existing navigation links and sticky behavior remain unchanged."
      ]
    },
    {
      "id": "REQ-53",
      "text": "In Footer.tsx, increase the font size of all footer content lines — the brand line ('ProSellers — Amazon Growth Consultant'), the global serving line ('Serving clients globally — USA 🇺🇸 | UK 🇬🇧 | Canada 🇨🇦 | Australia 🇦🇺'), the timezone line ('Operating globally across US & UK time zones'), the India-based line ('India-based Amazon Growth Consultant working with USA & UK brands globally.'), and the copyright notice — so they are all noticeably larger and more readable than the current size. Maintain the existing dark background, muted/white text color scheme, and centered alignment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "also incrase the all footer content fornt sizes",
          "Increase all footer content font sizes (brand line, global serving line, timezone line, India-based line, copyright) for better readability"
        ]
      },
      "acceptanceCriteria": [
        "All footer text lines are visibly larger than before the change.",
        "The brand name line is the largest, with supporting lines clearly readable at a smaller but still comfortable size.",
        "The footer retains its dark background, centered layout, and existing text color scheme.",
        "No footer content is missing or truncated."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ or frontend/src/components/ui/.",
    "Do not alter any section other than AboutSection, Navigation, and Footer.",
    "The consultant's personal name 'Mayur Sahu' must remain unchanged everywhere it appears."
  ],
  "nonGoals": [
    "Adding the photo to any section other than the About / Meet The Founder section.",
    "Changing any navigation links, section order, or page layout.",
    "Modifying any backend files."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Crop and reframe to a professional portrait headshot with subject centered, navy blue blazer and white shirt clearly visible, framed artwork wall background, optimized for a 400x500px display slot (PixVerse_Image_Effect_prompt_this is my noraml.jpg > mayur-sahu-headshot-new.dim_400x500.png)"
    ]
  }
}