{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace About headshot, add crown to ProSellers logo, increase footer font sizes",
  "requirements": [
    {
      "id": "REQ-51",
      "summary": "Replace the existing headshot image in AboutSection with the newly generated asset mayur-sahu-headshot-new.dim_400x500.png while preserving all layout, animations, and credential content",
      "acceptanceCriteria": [
        "The About / Meet The Founder section displays the new photo of Mayur Sahu (navy blue blazer, white shirt, framed artwork background) instead of the old headshot.",
        "The image renders correctly in both desktop two-column layout and mobile stacked layout.",
        "Gold corner accents and scroll-triggered slide-in animations are unaffected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AboutSection.tsx",
          "operation": "modify",
          "description": "Update the image source in the headshot image element to reference frontend/public/assets/generated/mayur-sahu-headshot-new.dim_400x500.png instead of the current headshot path. Ensure the image alt text remains descriptive and that all existing gold corner accent overlays, scroll-triggered slide-in animations, and the credential list with CheckCircle icons remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Add a gold crown emoji 👑 before the 'ProSellers' brand name in the Navigation bar logo area, styled in gold color",
      "acceptanceCriteria": [
        "The Navigation bar logo area displays '👑 ProSellers' with the crown emoji rendered in gold color before the brand name.",
        "The crown appears on both desktop and mobile navigation views.",
        "All existing navigation links and sticky behavior remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add the gold crown emoji 👑 immediately before the 'ProSellers' brand name text in the logo/brand area. Apply inline or className styling to render the crown in gold color (#C9A84C). Ensure the crown appears in both the desktop navigation and the mobile hamburger menu header. All existing navigation links, smooth-scroll behavior, sticky positioning, and the Book Call CTA must remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Increase font sizes for all footer content lines to improve readability while maintaining the existing dark background, color scheme, and centered alignment",
      "acceptanceCriteria": [
        "All footer text lines are visibly larger than before the change.",
        "The brand name line is the largest, with supporting lines clearly readable at a smaller but still comfortable size.",
        "The footer retains its dark background, centered layout, and existing text color scheme.",
        "No footer content is missing or truncated."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Increase the font size of all footer content lines: the brand line ('ProSellers — Amazon Growth Consultant'), the global serving line ('Serving clients globally — USA 🇺🇸 | UK 🇬🇧 | Canada 🇨🇦 | Australia 🇦🇺'), the timezone line ('Operating globally across US & UK time zones'), the India-based line ('India-based Amazon Growth Consultant working with USA & UK brands globally.'), and the copyright notice. The brand line should be the largest, with other lines proportionally larger than current sizes for better readability. Maintain the existing dark background, muted/white text color scheme, centered alignment, and all existing spacing."
        }
      ]
    }
  ]
}