{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix GlobalServiceSection flag and country name rendering",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Rewrite GlobalServiceSection.tsx to ensure flag emojis and country names render correctly across all browsers by using hard-coded plain string literals for country names and explicit inline font-family styles for flag emoji spans",
      "acceptanceCriteria": [
        "All four flag emojis (🇺🇸 🇬🇧 🇨🇦 🇦🇺) render as visible colored flag images, not squares or boxes, on Chrome, Firefox, Safari, and Edge.",
        "All four country name labels ('United States', 'United Kingdom', 'Canada', 'Australia') render as readable plain text with zero tofu/square characters on all browsers.",
        "Each flag emoji span has an explicit inline font-family style including 'Apple Color Emoji', 'Segoe UI Emoji', 'Noto Color Emoji' fallbacks.",
        "Country name strings are hard-coded plain string literals in the data array — no Unicode character codes or abbreviations used.",
        "Glassmorphism card styling with gold border accents is retained.",
        "Scroll-triggered entrance animations are retained and functional.",
        "The section heading 'Serving Amazon Sellers Globally' remains visible and correctly styled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GlobalServiceSection.tsx",
          "operation": "modify",
          "description": "Rewrite the component to define a JavaScript array of four country objects where each object contains an 'emoji' string property holding the raw flag emoji character (🇺🇸, 🇬🇧, 🇨🇦, 🇦🇺) and a 'name' string property holding the fully explicit hard-coded plain string literal ('United States', 'United Kingdom', 'Canada', 'Australia') with zero reliance on Unicode abbreviations or character codes. Render each flag emoji inside a dedicated <span> element with an explicit inline style object setting fontFamily to 'Apple Color Emoji, Segoe UI Emoji, Noto Color Emoji, Android Emoji, EmojiSymbols, sans-serif' to force proper emoji font fallback across all browsers. Render each country name as a separate plain <span> JSX text node with the string value typed directly as a plain literal — no template literals, no computed values, no character codes. Retain the existing glassmorphism card styling with gold border accents, the grid layout, hover scale/shadow animations, and the IntersectionObserver-based scroll-triggered entrance animations with staggered delays. Ensure the section heading 'Serving Amazon Sellers Globally' remains visible and correctly styled. Do not change the card structure, layout logic, or animation behavior beyond what is necessary to fix the flag emoji and country name rendering issues."
        }
      ]
    }
  ]
}